TH Provision Plan

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_TH_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_TH_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_TH_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_conversations_chat_transfer_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_conversations_chat_transfer_workflow_sid" {
        id             = "/production/twilio/AC77e853192a62159196decc2468243518/conversations_chat_transfer_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC77e853192a62159196decc2468243518/conversations_chat_transfer_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/conversations_chat_transfer_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "channelType IN ['web','instagram','line']  OR isContactlessTask == true OR  twilioNumber IN ['messenger:59591583805', 'twitter:1154628838472597505', 'instagram:59591583805', 'line:U65333e6b8ca9e96e41252ecb27c44cf9']"
                            filter_friendly_name = "Childline Thailand"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQc1783ea233b86159b221f6e384e82285"
                                },
                            ]
                        },
                        {
                            expression           = "channelType=='web' AND e2eTestMode=='true'"
                            filter_friendly_name = "E2E Test"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQ4ee1599318c0fbbe7efbb04019e9e223"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS52f1c6a440f61a5d6075f5f3aeb351bf/WW3d4eff0e8595f4506363dcff91946d15"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["queue_transfers"] will be created
  + resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      + assignment_callback_url          = (known after apply)
      + configuration                    = jsonencode(
            {
              + task_routing = {
                  + filters = [
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ4ee1599318c0fbbe7efbb04019e9e223'"
                          + filter_friendly_name = "e2e_test"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ4ee1599318c0fbbe7efbb04019e9e223"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQc1783ea233b86159b221f6e384e82285'"
                          + filter_friendly_name = "master"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQc1783ea233b86159b221f6e384e82285"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ8736e518c18e1b010992c8d7337602d5'"
                          + filter_friendly_name = "survey"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQc1783ea233b86159b221f6e384e82285"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      + fallback_assignment_callback_url = (known after apply)
      + friendly_name                    = "Queue Transfers Workflow"
      + id                               = (known after apply)
      + re_evaluate_tasks                = (known after apply)
      + sid                              = (known after apply)
      + task_reservation_timeout         = (known after apply)
      + workspace_sid                    = "WS52f1c6a440f61a5d6075f5f3aeb351bf"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQ8736e518c18e1b010992c8d7337602d5"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS52f1c6a440f61a5d6075f5f3aeb351bf/WW073bdfe856c4345e1569db2125aac654"
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WW3d4eff0e8595f4506363dcff91946d15" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master          = "WW3d4eff0e8595f4506363dcff91946d15" -> (known after apply)
      + queue_transfers = (known after apply)
      ~ survey          = "WW073bdfe856c4345e1569db2125aac654" -> (known after apply)
    }